app/views/carts/_cart.html.erb

<% if cart.line_items.count > 0%>
---
SELECT "line_items".* FROM "line_items" WHERE ("line_items".cart_id = 7)
SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 8)