app/controllers/carts_controller.rb

  def destroy
    @cart = Cart.find(params[:id])
    @cart.destroy
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = 1 LIMIT 1
DELETE FROM "carts" WHERE "carts"."id" = 1