app/controllers/line_items_controller.rb

SELECT "line_items".* FROM "line_items"
---
  def index
    @line_items = LineItem.where(:status => [LineItem::VERIFIED, LineItem::FILLED])
    @line_items = @line_items.order('created_at desc')
    @line_items = LineItem.paginate :page=>params[:page], :order=>'created_at desc',
    :per_page => 10

SELECT "products".* FROM "products" WHERE "products"."id" = 7 ORDER BY title LIMIT 1
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-02-26 20:43:22.738580', '2011-02-26 20:43:22.738580')
INSERT INTO "line_items" ("updated_at", "created_at", "order_id", "product_id", "cart_id", "quantity") VALUES ('2011-02-27 23:18:00.613302', '2011-02-27 23:18:00.613302', NULL, 207281424, 980190963, 1)
UPDATE "line_items" SET "updated_at" = '2011-02-26 20:24:52.980308', "quantity" = 2 WHERE "line_items"."id" = 2
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save