app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"
---
  def index
    @orders = Order.paginate :page=>params[:page], :order=>'created_at desc',
    :per_page => 10

SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 8)
---
  def new
    if current_cart.line_items.empty?

INSERT INTO "orders" ("created_at", "address", "name", "email", "pay_type", "updated_at") VALUES ('2011-03-24 17:47:05.841951', '82493237', 'Lindsey', 'lindsey.eatough@gmail.com', 'Credit card', '2011-03-24 17:47:05.841951')
DELETE FROM "carts" WHERE "carts"."id" = 20
SELECT "line_items".* FROM "line_items" WHERE ("line_items".cart_id = 8)
---
  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        Notifier.order_received(@order).deliver