app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = 7 ORDER BY title LIMIT 1
---
  def show
    @product = Product.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = 980190962 ORDER BY title LIMIT 1
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO "products" ("updated_at", "image_url", "description", "title", "created_at", "price") VALUES ('2011-02-26 19:29:20.206686', 'lorem.jpg', 'Wibbles are fun!', 'Lorem Ipsum', '2011-02-26 19:29:20.206686', 19.95)
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = 980190962 ORDER BY title LIMIT 1
UPDATE "products" SET "updated_at" = '2011-02-26 19:52:18.104469', "description" = 'Wibbles are fun!', "image_url" = 'lorem.jpg', "title" = 'Lorem Ipsum', "price" = 19.95 WHERE "products"."id" = 980190962
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT "products".* FROM "products" WHERE "products"."id" = 980190962 ORDER BY title LIMIT 1
DELETE FROM "products" WHERE "products"."id" = 980190962
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = 3 ORDER BY title LIMIT 1
---
  def who_bought
    @product = Product.find(params[:id])