app/controllers/stands_controller.rb

  def index
    @stands = Stand.all
---
SELECT "stands".* FROM "stands"