app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT "users".* FROM "users" ORDER BY name

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "hashed_password", "name", "updated_at", "salt") VALUES ('2011-02-27 21:07:39.524597', '1566aabaae6536a227718ac5f78d81aa968f3d84e275325df5b8f8599de2ffcc', 'Tosin', '2011-02-27 21:07:39.524597', '21833568600.42087309097672')